app/Models/BlogModel.php

    public function blogStatus(): ?array
    {
        return $this->db
            ->table('blogstatus')
            ->limit(1)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `blogstatus`
 LIMIT 1

    public function blogListu(int $limit, int $offset): array
    {
        return $this->orderBy('id', 'desc')
            ->findAll($limit, $offset);
---
SELECT *
FROM `blog`
ORDER BY `id` DESC
 LIMIT 12

    public function num_rows(): int
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `blog`