app/Models/ContactDetails.php

    public function getDetails(): ?array
    {
        return $this->first();
---
SELECT *
FROM `contactdetails`
 LIMIT 1