app/Models/GalleryModel.php

SELECT *
FROM `gcategory`
ORDER BY `id` ASC
SELECT COUNT(*) AS `numrows`
FROM `gallery`
WHERE `catId` = '7'
---
    public function listCat(): array
    {
        $categories = $this->db
            ->table('gcategory')
            ->orderBy('id', 'asc')
            ->get()
            ->getResultArray();

        foreach ($categories as $index => $category) {
            $categories[$index]['count'] = $this->db
                ->table('gallery')
                ->where('catId', $category['id'])
                ->countAllResults();

SELECT *
FROM `gallery`
ORDER BY `id` ASC
---
    public function listGallery(): array
    {
        return $this->orderBy('id', 'asc')->findAll();