app/Models/MainModel.php

    public function all_pages(): array
    {
        return $this->db
            ->table('pages')
            ->select('page_order, position, status, permalink, title')
            ->orderBy('page_order', 'asc')
            ->get()
            ->getResultArray();
---
SELECT `page_order`, `position`, `status`, `permalink`, `title`
FROM `pages`
ORDER BY `page_order` ASC

    private function blogStatus(): ?array
    {
        return $this->firstRow('blogstatus');
---
SELECT *
FROM `blogstatus`
 LIMIT 1