app/Models/OrderModel.php

    public function getStripe(): array
    {
        $row = $this->db
            ->table('stripe-settings')
            ->where('id', 1)
            ->limit(1)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `stripe-settings`
WHERE `id` = 1
 LIMIT 1